In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [4]:
df.drop(['PassengerId','Name','Ticket','Cabin'], axis=1,inplace=True)

In [5]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [6]:
df.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [7]:
df['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [8]:
df['Embarked']=df['Embarked'].fillna('S')

In [9]:
df['Sex'].replace(['female','male'],[0,1],inplace=True)

In [10]:
df['Embarked'].replace(['S','C','Q'],[0,1,2],inplace=True)

In [11]:
df.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    1  22.0      1      0   7.2500         0
1         1       1    0  38.0      1      0  71.2833         1
2         1       3    0  26.0      0      0   7.9250         0
3         1       1    0  35.0      1      0  53.1000         0
4         0       3    1  35.0      0      0   8.0500         0

In [12]:
df['Age'] = df['Age'].fillna(df['Age'].median())

In [13]:
df.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [14]:
from sklearn.model_selection import train_test_split
x = df.drop("Survived",axis = 1)
y = df["Survived"]
x_train, x_test ,y_train , y_test = train_test_split(x ,y, test_size=0.2 ,random_state=100)

In [15]:
from sklearn import metrics 
from sklearn.ensemble import RandomForestClassifier
rf_model = RandomForestClassifier(class_weight='balanced', criterion = "gini" ,min_samples_leaf=1, min_samples_split=16, n_estimators=700)
rf_model.fit(x_train,y_train)
y_pred=rf_model.predict(x_test)
#rf_model.score(x_train,y_train)
print("Accuracy: {0}".format(metrics.accuracy_score(y_test,y_pred)))
print("Recall/Sensitivity: {0}".format(metrics.recall_score(y_test,y_pred)))

Accuracy: 0.8603351955307262
Recall/Sensitivity: 0.8

In [16]:
rf_model.predict([[1,0,40.0,1,0,93.5,1]])[0]

1

In [17]:
import pickle
file=open('random_forest_titanic_model.pkl','wb')
pickle.dump(rf_model,file)